---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCImportAction
source: html/fa9e1b3a-fbed-c864-c48f-518c894b11ca.htm
---
# Autodesk.Revit.DB.IFC.IFCImportAction

The action of the IFC import.

## Syntax (C#)
```csharp
public enum IFCImportAction
```